Update architecture & diagrams for project 'test-2'
